waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_vao.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_vao.h
  * @author  FMSH Application Team
  * @brief   Head file of VAO FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_VAO_H
#define __FM33FK5XX_FL_VAO_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup VAO_FL_ES_INIT VAO Exported Init structures
  * @{
  */

/**
  * @brief FL VAO Init Sturcture definition
  */
typedef struct
{
    uint32_t pin;
    /*! PH输入使能 */
    uint32_t input;
    /*! PH上下拉使能 */
    uint32_t pull;
    /*! PH开漏输出使能 */
    uint32_t opendrainOutput;
    /*! PH功能选择 */
    uint32_t mode;
    /* 驱动强度*/
    uint32_t driveStrength;

} FL_VAO_IO_InitTypeDef;

typedef struct
{
    /*! 驱动能力配置 */
    uint32_t driveMode;
    /*! 工作电流大小*/
    uint32_t workingCurrentMode;

} FL_VAO_XTLF_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup VAO_FL_Exported_Constants VAO Exported Constants
  * @{
  */

#define    VAO_RSTCR_VBAT_RST_Pos                                 (0U)
#define    VAO_RSTCR_VBAT_RST_Msk                                 (0x1U << VAO_RSTCR_VBAT_RST_Pos)
#define    VAO_RSTCR_VBAT_RST                                     VAO_RSTCR_VBAT_RST_Msk

#define    VAO_XTLFCR_WAIT_Pos                                    (13U)
#define    VAO_XTLFCR_WAIT_Msk                                    (0x7U << VAO_XTLFCR_WAIT_Pos)
#define    VAO_XTLFCR_WAIT                                        VAO_XTLFCR_WAIT_Msk

#define    VAO_XTLFCR_EXCKSEN_Pos                                 (12U)
#define    VAO_XTLFCR_EXCKSEN_Msk                                 (0x1U << VAO_XTLFCR_EXCKSEN_Pos)
#define    VAO_XTLFCR_EXCKSEN                                     VAO_XTLFCR_EXCKSEN_Msk

#define    VAO_XTLFCR_XTLFEN_Pos                                  (8U)
#define    VAO_XTLFCR_XTLFEN_Msk                                  (0xfU << VAO_XTLFCR_XTLFEN_Pos)
#define    VAO_XTLFCR_XTLFEN                                      VAO_XTLFCR_XTLFEN_Msk

#define    VAO_XTLFCR_RDY_Pos                                     (7U)
#define    VAO_XTLFCR_RDY_Msk                                     (0x1U << VAO_XTLFCR_RDY_Pos)
#define    VAO_XTLFCR_RDY                                         VAO_XTLFCR_RDY_Msk

#define    VAO_XTLFCR_DRVCFG_Pos                                  (2U)
#define    VAO_XTLFCR_DRVCFG_Msk                                  (0x7U << VAO_XTLFCR_DRVCFG_Pos)
#define    VAO_XTLFCR_DRVCFG                                      VAO_XTLFCR_DRVCFG_Msk

#define    VAO_XTLFCR_XTLFIPW_Pos                                 (0U)
#define    VAO_XTLFCR_XTLFIPW_Msk                                 (0x3U << VAO_XTLFCR_XTLFIPW_Pos)
#define    VAO_XTLFCR_XTLFIPW                                     VAO_XTLFCR_XTLFIPW_Msk

#define    VAO_LFDIER_LFDET_IE_Pos                                 (0U)
#define    VAO_LFDIER_LFDET_IE_Msk                                 (0x1U << VAO_LFDIER_LFDET_IE_Pos)
#define    VAO_LFDIER_LFDET_IE                                     VAO_LFDIER_LFDET_IE_Msk

#define    VAO_LFDISR_LFDETO_Pos                                   (1U)
#define    VAO_LFDISR_LFDETO_Msk                                   (0x1U << VAO_LFDISR_LFDETO_Pos)
#define    VAO_LFDISR_LFDETO                                       VAO_LFDISR_LFDETO_Msk

#define    VAO_LFDISR_LFDETIF_Pos                                  (0U)
#define    VAO_LFDISR_LFDETIF_Msk                                  (0x1U << VAO_LFDISR_LFDETIF_Pos)
#define    VAO_LFDISR_LFDETIF                                      VAO_LFDISR_LFDETIF_Msk

#define    VAO_INEN_PHINEN_Pos                                    (0U)
#define    VAO_INEN_PHINEN_Msk                                    (0x1U << VAO_INEN_PHINEN_Pos)
#define    VAO_INEN_PHINEN                                        VAO_INEN_PHINEN_Msk

#define    VAO_PUPDEN_PHPDEN_Pos                                  (15U)
#define    VAO_PUPDEN_PHPDEN_Msk                                  (0x1U << VAO_PUPDEN_PHPDEN_Pos)
#define    VAO_PUPDEN_PHPDEN                                      VAO_PUPDEN_PHPDEN_Msk

#define    VAO_PUPDEN_PHPUEN_Pos                                  (0U)
#define    VAO_PUPDEN_PHPUEN_Msk                                  (0x1U << VAO_PUPDEN_PHPUEN_Pos)
#define    VAO_PUPDEN_PHPUEN                                      VAO_PUPDEN_PHPUEN_Msk

#define    VAO_ODEN_PHODEN_Pos                                    (0U)
#define    VAO_ODEN_PHODEN_Msk                                    (0x1U << VAO_ODEN_PHODEN_Pos)
#define    VAO_ODEN_PHODEN                                        VAO_ODEN_PHODEN_Msk

#define    VAO_FCR_PHFCR_Pos                                      (0U)
#define    VAO_FCR_PHFCR_Msk                                      (0x3U << VAO_FCR_PHFCR_Pos)
#define    VAO_FCR_PHFCR                                          VAO_FCR_PHFCR_Msk

#define    VAO_DOR_PHDO_Pos                                       (0U)
#define    VAO_DOR_PHDO_Msk                                       (0x1U << VAO_DOR_PHDO_Pos)
#define    VAO_DOR_PHDO                                           VAO_DOR_PHDO_Msk

#define    VAO_DIN_PHDIN_Pos                                      (0U)
#define    VAO_DIN_PHDIN_Msk                                      (0x1U << VAO_DIN_PHDIN_Pos)
#define    VAO_DIN_PHDIN                                          VAO_DIN_PHDIN_Msk

#define    VAO_DSR_PHDSR_Pos                                      (0U)
#define    VAO_DSR_PHDSR_Msk                                      (0x3U << VAO_DSR_PHDSR_Pos)
#define    VAO_DSR_PHDSR                                           VAO_DSR_PHDSR_Msk

#define    FL_VAO_PH_PIN_13                                       (0x1U << 13U)
#define    FL_VAO_PH_PIN_14                                       (0x1U << 14U)
#define    FL_VAO_PH_PIN_15                                       (0x1U << 15U)

