waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_vao.h
/**
  * @brief    Set pin output 1
  * @rmtoll   PHDSET    PHDSET    FL_VAO_GPIO_SetPHOutputPin
  * @param    VAOx VAO instance
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_VAO_PH_PIN_13
  *           @arg @ref FL_VAO_PH_PIN_14
  *           @arg @ref FL_VAO_PH_PIN_15
  * @retval   None
  */
__STATIC_INLINE void FL_VAO_GPIO_SetPHOutputPin(VAO_Type *VAOx, uint32_t pin)
{
    SET_BIT(VAOx->DOR, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Set pin output 0
  * @rmtoll   PHDRESET    PHDRESET    FL_VAO_GPIO_ResetPHOutputPin
  * @param    VAOx VAO instance
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_VAO_PH_PIN_13
  *           @arg @ref FL_VAO_PH_PIN_14
  *           @arg @ref FL_VAO_PH_PIN_15
  * @retval   None
  */
__STATIC_INLINE void FL_VAO_GPIO_ResetPHOutputPin(VAO_Type *VAOx, uint32_t pin)
{
    CLEAR_BIT(VAOx->DOR, ((pin & 0xffff) << 0x0U));
}

/**
  * @}
  */

/** @defgroup VAO_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_VAO_DeInit(VAO_Type *VAOx);
FL_ErrorStatus FL_VAO_IO_Init(VAO_Type *VAOx, FL_VAO_IO_InitTypeDef *VAO_IO_InitStruct);
FL_ErrorStatus FL_VAO_XTLF_Init(VAO_Type *VAOx, FL_VAO_XTLF_InitTypeDef *VAO_XTLF_InitStruct);
void FL_VAO_XTLF_StructInit(FL_VAO_XTLF_InitTypeDef *VAO_XTLF_InitStruct);
void FL_VAO_IO_StructInit(FL_VAO_IO_InitTypeDef *VAO_IO_InitStruct);
/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_VAO_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-08-24*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
